[{"name":"Free Java Programming Course with Certificate",
  "url":"https://www.mygreatlearning.com/academy/learn-for-free/courses/java-programming",
  "Price":"0",
  "Description":"This free Java course will introduce you to the world of Java Programming. Explore the fundamentals of Java, like syntax, functions, and arrays. Enroll in this beginner course and kickstart your programming career in Java.",
  "Rating":"4.48",
  "type":"Java",
  "image":"share-certificate.png"
},
{"name":"Free Java Full Stack Developer Course With Certificate",
  "url":"https://www.simplilearn.com/free-full-stack-java-developer-course-skillup",
  "Price":"0",
  "Description":"Full-stack developers are in high demand. As a full-stack Java developer, you have the capability to own and operate the entire development process, from building the front-end UI to writing back-end logic and connecting to databases. This comprehensive free online Java full-stack developer course will equip you with the skills required to become an accomplished full-stack Java developer.",
  "Rating":"4.5",
  "type":"Java",
  "image":"fullstack.avif"
},
{"name":"FULL STACK JAVA DEV: JAVA + JSP + SPRING + BOOT + JS + REACT",
  "url":"https://www.udemy.com/share/101WBK/",
  "Price":"549(Discounted)",
  "Description":"Dive into our Full Stack Java Development course designed for all skill levels. Whether you're a seasoned IT professional looking to expand your skillset or a newcomer eager to explore the world of web development, our comprehensive course is crafted to cater to all levels of expertise.",
  "Rating":"4.3",
  "type":"Java",
  "image":"thumb-1.jpg"
},
{"name":"Object Oriented Programming in Java Course Online",
  "url":"https://www.scaler.com/topics/course/object-oriented-programming-java/",
  "Price":"0",
  "Description":"Discover the power of Object-Oriented Programming with our free beginners Java course. Learn the fundamentals of classes, objects, inheritance, and polymorphism. Dive into encapsulation and abstraction techniques. Gain hands-on experience through practical exercises and projects. Start your coding journey today!",
  "Rating":"4.95",
  "type":"Java",
  "image":"oops.webp"
},
{"name":"Java Course Online",
  "url":"https://edrk.in/jX5vcdu",
  "Price":"19995",
  "Description":"Java certification training by Edureka is designed to meet industry benchmarks and is curated by top industry experts. The Java Course online guides you to become an Oracle-certified professional and clear the Java SE8 programmer or Java SE11 developer certification exam on the first attempt. This online Java training will give you extensive knowledge of basic and advanced concepts of Core Java and J2EE, as well as popular frameworks like Hibernate, Spring, and SOA.",
  "Rating":"4.6",
  "type":"Java",
  "image":"edu.webp"
},
{"name":"Java Full Course for free ☕",
  "url":"https://youtu.be/xk4_1vDrzzo?si=ZSr1Dz4H5zf6ADB_",
  "Price":"0",
  "Description":"This course is free of cost and provides quality knowledge about java programming language.Enjoy your course!",
  "Rating":"4.3",
  "type":"Java",
  "image":"utube.webp"
},
{"name":"Java and DSA Foundation Course",
  "url":"https://youtube.com/playlist?list=PLxgZQoSe9cg00xyG5gzb5BMkOClkch7Gr&si=aZLTN4yi-rBXzbgP",
  "Price":"0",
  "Description":"College wallah provides you the best courses available for free,from basics to advance.",
  "Rating":"4",
  "type":"Java",
  "image":"wallah.jpg"
},
{"name":"Java in One Shot | Revision - 1 | Output, Input, Variables, Operators | Java Course",
  "url":"https://youtu.be/Byf6xOYdNcw?si=9-31HpYsjHaT2blr",
  "Price":"0",
  "Description":"In this video, Raghav Sir will teach you the initial basic topics of Java in one shot. This video can be seen as a revision video if you are already following the Java and DSA Foundation Course, and even if you want to start from scratch as your first lecture. In this video, you will learn Input / Output, Variables, Operators and Conditionals.",
  "Rating":"4",
  "type":"Java",
  "image":""
}
]
