[{
    "name":"Rust For Undergrads",
    "url":"https://www.udemy.com/course/rust-for-undergrads/",
    "price":"0",
    "Description":"Rust is a systems programming language sponsored by Mozilla which describes it as a 'safe, concurrent, practical language', supporting functional and imperative-procedural paradigms. Rust is syntactically similar to C++, but its designers intend it to provide better memory safety while still maintaining performance prevents segfaults, and guarantees thread safety. In this course, you will learn the basics of Rust programming language which would help you get started.",
    "Rating":"3.8",
    "Type":"Rust",
    "image":"FreeRust.jpg"
},
{
    "name":"Rust Tutorial for Beginners - Full Course",
    "url":"https://youtu.be/qP7LzZqGh30?si=W11VwqhCz5C9dID9",
    "price":"0",
    "Description":"In this video, Harkirat takes you through four hours of learning rust from the basics. It covers concepts like memory management, ownership, borrowing, structures, data types, enums, and much more.",
    "Rating":"4",
    "Type":"Rust",
    "image":"RustBoot.jpg"

},
{
    "name":"Rust Tutorial For Beginners | Two Rust Projects",
    "url":"https://youtu.be/Jcbh07P0jHU?si=SKEOr_sWwjHHVmm7",
    "price":"0",
    "Description":"A Rust programming course is designed to teach developers the core concepts and advanced features of the Rust programming language, with a focus on building safe, efficient, and concurrent applications. Whether for beginners new to systems programming or experienced developers looking to expand their skill set, a Rust course offers a structured approach to mastering this modern language.",
    "Rating":"4",
    "Type":"Rust",
    "image":"codeRust.jpg"
},
{
    "name":"Corso introduttivo per programmare in Rust"
    "url":"https://www.udemy.com/course/corso-introduttivo-per-programmare-in-rust/",
    "price":"0"
    "Description":"Rust è un linguaggio di programmazione che sta diventando sempre più popolare fra gli sviluppatori di tutto il mondo. E' stato concepito per superare alcune delle limitazioni del linguaggio C++ specialmente nella gestione della memoria. In questo corso introduttivo, interamente in italiano, vengono fornite le basi della programmazione in Rust attraverso video altamente interattivi, così che lo studente possa ripetere sul suo computer esattamente quello che vede fare dall'insegnante sullo schermo.",
    "Rating":"4",
    "Type":"Rust",
    "image":"rustudem.jpg",
},
{
    "name":"Basic Rust Programming Language Course",
    "url":"https://www.brainmeasures.com/video/854/basic-rust-programming-language-course",
    "price":"5796",
    "Description":"Rust is a multi-paradigm programming language designed for performance and safety, especially safe concurrency. Rust is syntactically similar to C++ but can guarantee memory safety by using a borrow checker to validate references. Rust achieves memory safety without garbage collection, and reference counting is optional.",
    "Rating":"3.8",
    "Type":"Rust",
    "image":"RustBrain",
},
{
    "name":"Rust Programming Essentials Course",
    "url":"https://expertrainingdownload.com/product/rust-programming-essentials-course/",
    "price":"840",
    "Description":"In the course, you will learn about the Rust toolset, the Rust type system, how to implement flow control, how to use compound types and collections, and how Rust carefully manages the lifetime of objects and how they are referenced safely in your code.",
    "Rating":"4.9",
    "Type":"Rust",
    "image":"RustExpert.jpg"
},
{
    "name":"Rust Programming Foundations & Rust Advanced Concepts and Real-World Projects",
    "url":"https://expertrainingdownload.com/product/rust-programming-foundations-rust-advanced-concepts-and-real-world-projects/",
    "price":"840",
    "Description":"Rust Programming Part 1: Foundations & Part 2: Rust Advanced Concepts and Real-World Projects",
    "Rating":"4.5",
    "Type":"Rust",
    "image":"RustProgramming2.jpg",
},
{
    "name":"Ultimate Rust 2 Intermediate Concepts",
    "url":"https://www.udemy.com/share/105w4Q/",
    "price":"2999",
    "Description":"This is a hands-on course! Not only are there targeted exercise for each topic discussed, there are also a series of project scenarios that walk you through using what you've learned to put together playable game prototypes that work on macOS, Linux, and Windows!  These projects will make use of Rusty Engine, a game engine developed specifically for this course to keep game engine concepts to a minimum so you can focus on using exactly what you learned in this course.",
    "Rating":"4.6",
    "Type":"Rust",
    "image":"RustUltimate2",

},
{
    "name":"Learn Rust by Building Real Applications",
    "url":"https://www.udemy.com/share/103oeY/",
    "price":"3099",
    "Description":"In this course you will learn the fundamentals of Rust. The format will be a bit different than most other courses. Instead of jumping between unrelated concepts in every video and showing examples that have nothing to do with the real world use of the language, we will learn entirely through practice.",
    "Rating":"4.6"
    "Type":"Rust",
    "image":"LearnRust.jpg",
},
{
    "name":"The Rust Programming Language",
    "url":"https://www.udemy.com/share/101Z1I/",
    "Price":"2899",
    "Description":"This course will teach you the fundamentals of Rust, a modern programming language that has the both the power of native code as well as the safety of some managed languages.",
    "Rating":"4.3",
    "Type":"Rust",
    "image":"TheRust.jpg"
}
]
